const text1 =
  '본 이용약관은 “더킹스컴퍼니”(이하 "회사")의 서비스의 이용조건과 운영에 관한 제반사항 규정을 목적으로 합니다.';

const titleText1 = '제 1조 목적';

const text2 = `본 약관에서 사용되는 주요한 용어의 정의는 다음과 같습니다.
① 회원 : 어플리케이션의 약관에 동의하고 개인정보를 제공하여 회원등록을 한 자로서, 어플리케이션와의 이용계약을 체결하고 어플리케이션를 이용하는 이용자를 말합니다.
② 이용계약 : 어플리케이션 이용과 관련하여 어플리케이션와 회원간에 체결 하는 계약을 말합니다.
③ 회원 아이디(이하 "ID") : 회원의 식별과 회원의 서비스 이용을 위하여 회원별로 부여하는 고유한 문자와 숫자의 조합을 말합니다.
④ 비밀번호 : 회원이 부여받은 ID와 일치된 회원임을 확인하고 회원의 권익보호를 위하여 회원이 선정한 문자와 숫자의 조합을 말합니다.
⑤ 운영자 : 서비스에 홈페이지를 개설하여 운영하는 운영자를 말합니다.
⑥ 해지 : 회원이 이용계약을 해약하는 것을 말합니다.`;

const titleText2 = '제 2조 용어의 정의';

const text3 = `운영자는 필요한 경우 별도로 운영정책을 공지 안내할 수 있으며, 본 약관과 운영정책이 중첩될 경우 운영정책이 우선 적용됩니다.`;

const titleText3 = `제 3조 약관외 준칙`;

const text4 = `① 이용계약은 회원으로 등록하여 어플리케이션를 이용하려는 자의 본 약관 내용에 대한 동의와 가입신청에 대하여 운영자의 이용승낙으로 성립합니다.
② 회원으로 등록하여 서비스를 이용하려는 자는 어플리케이션 가입신청시 본 약관을 읽고 아래에 있는 "동의합니다"를 선택하는 것으로 본 약관에 대한 동의 의사 표시를 합니다.`;

const titleText4 = `제 4조 이용계약 채결`;

const text5 = `① 회원으로 등록하여 어플리케이션를 이용하려는 이용자는 어플리케이션에서 요청하는 제반정보(이용자ID,비밀번호 등)를 제공해야 합니다.
② 타인의 정보를 도용하거나 허위의 정보를 등록하는 등 본인의 진정한 정보를 등록하지 않은 회원은 어플리케이션 이용과 관련하여 아무런 권리를 주장할 수 없으며, 관계 법령에 따라 처벌 받을 수 있습니다.`;

const titleText5 = `제 5조 서비스 이용 신청`;

const text6 = `어플리케이션 및 운영자는 회원가입시 제공한 개인정보 중 비밀번호를 가지고 있지 않으며 이와 관련된 부분은 어플리케이션의 개인정보처리방침을 따릅니다.
운영자는 관계법령이 정하는 바에 따라 회원등록정보를 포함한 회원의 개인정보를 보호하기 위하여 노력을 합니다.
회원의 개인정보보호에 관하여 관계법령 및 어플리케이션가 정하는 개인정보처리방침에 정한 바에 따릅니다.
단, 회원의 귀책사유로 인해 노출된 정보에 대해 운영자는 일체의 책임을 지지 않습니다.
운영자는 회원이 미풍양속에 저해되거나 국가안보에 위배되는 게시물 등 위법한 게시물을 등록 · 배포할 경우 관련기관의 요청이 있을시 회원의 자료를 열람 및 해당 자료를 관련기관에 제출할 수 있습니다.`;

const titleText6 = `제6조 개인정보처리방침`;

const text7 = `① 운영자는 이용회원으로부터 제기되는 의견이나 불만이 정당하다고 인정할 경우에는 가급적빨리 처리하여야 합니다. 다만, 개인적인 사정으로 신속한 처리가 곤란한 경우에는 사후에공지 또는 이용회원에게 쪽지, 전자우편 등을 보내는 등 최선을 다합니다.
② 운영자는 계속적이고 안정적인 어플리케이션 제공을 위하여 설비에 장애가 생기거나 유실된 때에는 이를 지체 없이 수리 또는 복구할 수 있도록 어플리케이션에 요구할 수 있습니다. 다만, 천재지변 또는 어플리케이션나 운영자에 부득이한 사유가 있는 경우, 어플리케이션 운영을 일시 정지할 수 있습니다.`;

const titleText7 = `제7조 운영자의 의무`;

const text8 = `① 회원은 본 약관에서 규정하는 사항과 운영자가 정한 제반규정, 공지사항 및 운영정책 등 어플리케이션가 공지하는 사항 및 관계법령을 준수하여야 하며, 기타 어플리케이션의 업무에 방해가 되는 행위, 어플리케이션의 명예를 손상시키는 행위를 해서는 안됩니다.
② 회원은 어플리케이션의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상 지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다.
③ 이용고객은 아이디 및 비밀번호 관리에 상당한 주의를 기울여야 하며, 운영자나 어플리케이션의 동의 없이 제3자에게 아이디를 제공하여 이용하게 할 수 없습니다.
④ 회원은 운영자와 어플리케이션 및 제3자의 지적 재산권을 침해해서는 안됩니다.`;

const titleText8 = `제8조 회원의 의무`;

const text9 = `① 서비스 이용시간은 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴 1일 24시간을 원칙으로 합니다. 단, 어플리케이션는 시스템 정기점검, 증설 및 교체를 위해 어플리케이션가 정한 날이나 시간에 서비스를 일시중단 할 수 있으며 예정된 작업으로 인한 서비스 일시 중단은 어플리케이션의 홈페이지에 사전에 공지하오니 수시로 참고하시길 바랍니다.
② 단, 어플리케이션는 다음 경우에 대하여 사전 공지나 예고없이 서비스를 일시적 혹은 영구적으로 중단할 수 있습니다.
긴급한 시스템 점검, 증설, 교체, 고장 혹은 오동작을 일으키는 경우
국가비상사태, 정전, 천재지변 등의 불가항력적인 사유가 있는 경우
전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지한 경우
서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
③ 전항에 의한 서비스 중단의 경우 어플리케이션는 사전에 공지사항 등을 통하여 회원에게 통지 합니다. 단, 어플리케이션가 통제할 수 없는 사유로 발생한 서비스의 중단에 대하여 사전공지가 불가능한 경우에는 사후공지로 대신합니다.`;

const titleText9 = `제9조 서비스 이용시간`;

const text10 = `① 회원이 어플리케이션와의 이용계약을 해지하고자 하는 경우에는 회원 본인이 온라인을 통하여 등록해지신청을 하여야 합니다. 한편, 어플리케이션 이용해지와 별개로 어플리케이션에 대한 이용계약 해지는 별도로 하셔야 합니다.
② 해지신청과 동시에 어플리케이션가 제공하는 어플리케이션 관련 프로그램이 회원관리 화면에서 자동적으로 삭제됨으로 운영자는 더 이상 해지신청자의 정보를 볼 수 없습니다.`;

const titleText10 = `제10조 서비스 이용 해지`;

const text11 = `회원은 다음 각 호에 해당하는 행위를 하여서는 아니되며 해당 행위를 한 경우에 어플리케이션는 회원의 서비스 이용 제한 및 적법한 조치를 취할 수 있으며 이용계약을 해지하거나 기간을 정하여 서비스를 중지할 수 있습니다.
① 회원 가입시 혹은 가입 후 정보 변경시 허위 내용을 등록하는 행위
② 타인의 어플리케이션 이용을 방해하거나 정보를 도용하는 행위
③ 어플리케이션의 운영진, 직원 또는 관계자를 사칭하는 행위
④ 어플리케이션, 기타 제3자의 인격권 또는 지적재산권을 침해하거나 업무를 방해하는 행위
⑤ 다른 회원의 ID를 부정하게 사용하는 행위
⑥ 다른 회원에 대한 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
⑦ 범죄와 결부된다고 객관적으로 판단되는 행위
⑧ 기타 관련 법령에 위배되는 행위`;

const titleText11 = `제11조 서비스 이용 제한`;

const text12 = `① 어플리케이션의 게시물과 자료의 관리 및 운영의 책임은 운영자에게 있습니다. 운영자는 항상 불량 게시물 및 자료에 대하여 모니터링을 하여야 하며, 불량 게시물 및 자료를 발견하거나 신고를 받으면 해당 게시물 및 자료를 삭제하고 이를 등록한 회원에게 주의를 주어야 합니다.
한편, 이용회원이 올린 게시물에 대해서는 게시자 본인에게 책임이 있으니 회원스스로 본 이용약관에서 위배되는 게시물은 게재해서된 안됩니다.
② 정보통신윤리위원회 등 공공기관의 시정요구가 있는 경우 운영자는 회원의 사전동의 없이 게시물을 삭제하거나 이동 할 수 있습니다.
불량게시물의 판단기준은 다음과 같습니다.
다른 회원 또는 제3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우
공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우
불법복제 또는 해킹을 조장하는 내용인 경우
영리를 목적으로 하는 광고일 경우
범죄와 결부된다고 객관적으로 인정되는 내용일 경우
다른 이용자 또는 제3자와 저작권 등 기타 권리를 침해하는 경우
기타 관계법령에 위배된다고 판단되는 경우4. 어플리케이션 및 운영자는 게시물 등에 대하여 제3자로부터 명예훼손, 지적재산권 등의 권리 침해를 이유로 게시중단 요청을 받은 경우 이를 임시로 게시중단(전송중단)할 수 있으며, 게시중단 요청자와 게시물 등록자 간에 소송, 합의 기타 이에 준하는 관련기관의 결정 등이 이루어져 어플리케이션에 접수된 경우 이에 따릅니다.`;

const titleText12 = `제12조 게시물의 관리`;

const text13 = `어플리케이션 운영자가 불가피한 사정으로 본 어플리케이션를 중단하게 될 경우, 회원에게 사전 공지를 하고 게시물의 이전이 쉽도록 모든 조치를 취하기 위해 노력합니다.`;

const titleText13 = `제13조 게시물의 보관`;

const text14 = `① 회원이 어플리케이션 내에 게시한 게시물의 저작권은 게시한 회원에게 귀속됩니다. 또한 어플리케이션는 게시자의 동의 없이 게시물을 상업적으로 이용할 수 없습니다. 다만 비영리 목적인 경우는 그러하지 아니하며, 또한 서비스 내의 게재권을 갖습니다.
② 회원은 서비스를 이용하여 취득한 정보를 임의 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용할 수 없습니다.
③ 운영자는 회원이 게시하거나 등록하는 어플리케이션 내의 내용물, 게시 내용에 대해 제12조 각 호에 해당된다고 판단되는 경우 사전통지 없이 삭제하거나 이동 또는 등록 거부할 수 있습니다.`;

const titleText14 = `제14조 게시물에 대한 저작권`;

const text15 = `① 본 어플리케이션의 발생한 모든 민,형법상 책임은 회원 본인에게 1차적으로 있습니다.
② 본 어플리케이션로부터 회원이 받은 손해가 천재지변 등 불가항력적이거나 회원의 고의 또는 과실로 인하여 발생한 때에는 손해배상을 하지 하지 않습니다.`;

const titleText15 = `제15조 손해배상`;

const text16 = `① 운영자는 회원이 어플리케이션의 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해서는 책임이 면제됩니다.
② 운영자는 본 어플리케이션의 서비스 기반 및 타 통신업자가 제공하는 전기통신서비스의 장애로 인한 경우에는 책임이 면제되며 본 어플리케이션의 서비스 기반과 관련되어 발생한 손해에 대해서는 어플리케이션의 이용약관에 준합니다
③ 운영자는 회원이 저장, 게시 또는 전송한 자료와 관련하여 일체의 책임을 지지 않습니다.
④ 운영자는 회원의 귀책사유로 인하여 서비스 이용의 장애가 발생한 경우에는 책임지지 아니합니다.
⑤ 운영자는 회원 상호간 또는 회원과 제3자 상호간, 기타 회원의 본 서비스 내외를 불문한 일체의 활동(데이터 전송, 기타 커뮤니티 활동 포함)에 대하여 책임을 지지 않습니다.
⑥ 운영자는 회원이 게시 또는 전송한 자료 및 본 어플리케이션로 회원이 제공받을 수 있는 모든 자료들의 진위, 신뢰도, 정확성 등 그 내용에 대해서는 책임지지 아니합니다.
⑦ 운영자는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 물품거래 등을 한 경우에 그로부터 발생하는 일체의 손해에 대하여 책임지지 아니합니다.
⑧ 운영자는 시삽의 귀책사유 없이 회원간 또는 회원과 제3자간에 발생한 일체의 분쟁에 대하여 책임지지 아니합니다.
⑨ 운영자는 서버 등 설비의 관리, 점검, 보수, 교체 과정 또는 소프트웨어의 운용 과정에서 고의 또는 고의에 준하는 중대한 과실 없이 발생할 수 있는 시스템의 장애, 제3자의 공격으로 인한 시스템의 장애, 국내외의 저명한 연구기관이나 보안관련 업체에 의해 대응방법이 개발되지 아니한 컴퓨터 바이러스 등의 유포나 기타 운영자가 통제할 수 없는 불가항력적 사유로 인한 회원의 손해에 대하여 책임지지 않습니다.
부칙
이 약관은 <어플리케이션 개설일> 부터 시행합니다.`;

const titleText16 = `제16조 면책`;

const cancelText1 = `① 본 약관은 더킹스컴퍼니(이하 ‘회사’)가 제공하는 전자지급결제대행서비스, 선불전자지급수단의 발행 및 관리서비스(이하 ‘전자금융거래서비스')를 취소·환불함에 있어, 회사와 회원간 권리, 의무 및 회원의 이용절차 등에 관한 사항을 규정하는 것을 그 목적으로 한다.
② 외부 및 현장 결제 방식을 통한 결제금액의 환불은 본 약관의 적용대상에 해당되지 않는다.`;

const cancelTitle1 = `제1조 (목적 및 적용대상)`;

const cancelText2 = `① 본 약관에서 정한 용어의 정의는 아래와 같다.
‘전자금융거래'란 회사가 전자적 장치를 통하여 전자금융업무를 제공하고, 회원이 회사의 종사자와 직접 대면 및 의사소통을 하지 아니하고 자동화된 방식으로 이를 이용하는 거래를 말한다.
‘회원'이라 함은 본 약관에 동의하고 본 약관에 따라 회사가 제공하는 전자금융거래서비스를 이용하는 자를 말한다.
② 본 조 및 본 약관의 다른 조항에서 정의한 것을 제외하고는 전자금융거래법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관련 법령에 정한 바를 따른다.`;

const cancelTitle2 = `제2조 (정의)`;

const cancelText3 = `① 회사 전자금융거래 서비스를 이용한 구매의 취소·환불 신청은 결제일로부터 30일 이내에 가능하다.
② 제1항에서 정한 기간이 도과한 경우 회원은 취소·변경·환불 신청이 불가하다.`;

const cancelTitle3 = `제3조 (취소 • 환불 신청 기간)`;

const cancelText4 = `① 회원은 제3조에서 정한 취소·환불 기간 이내에 아래의 방법으로 취소·환불을 신청할 수 있다.
고객센터 문의하기
② 결제수단, 환불 신청 시점, 환불 사유에 따른 환불 수수료가 부과될 수 있다.
③ 결제수단, 환불 신청 시점에 따라 환불 방식은 결제취소 또는 환불신청으로 다를 수 있다.
결제취소는 PG사를 통해 자동 환불 처리가 되는 방식을 말한다.
환불신청은 회사 고객센터로 환불 계좌를 접수하여 환불되는 방식을 말한다.
④ 결제 수단별 환불 시점 및 환불 방식은 아래와 같다.
신용카드
신용카드 결제시의 환불은 카드 결제 매출 취소를 원칙으로 한다.
회사에서의 환불 처리가 완료되고 카드사를 통한 결제승인이 취소되면 환불이 완료된다.
결제당일 이후 결제취소 시 카드사를 통한 결제승인 취소 확인은 3~7일 가량 소요될 수 있으며, 이는 카드사마다 다를 수 있다.
무통장입금 (가상계좌)
환불은 환불 계좌 접수 후 5~7일 이내에 접수된 계좌로 취소/환불 수수료를 공제한 금액으로 입금된다.
접수 계좌 오류, 증빙서류 미접수 등의 사유로 환불이 유보 또는 지연될 수 있으며, 이 경우 회원에게 별도 안내한다.
⑤ 환불 계좌의 접수
환불은 반드시 신청자 본인 명의의 계좌로 접수해야 한다. 신청자와 명의가 일치하지 않는 경우 회사는 증빙 서류를 요청할 수 있다.
증빙서류는 신청자 본인 명의의 이메일로만 접수받으며, 다른 이메일로 접수하거나 증빙서류 미접수 시 환불이 유보될 수 있다.
잘못된 환불 계좌 또는 증빙 서류를 접수하여 발생한 문제에 대하여 회사는 책임질 의무가 없다.`;

const cancelTitle4 = `제4조 (취소 • 환불 방법)`;

const cancelText5 = `① 취소·환불 수수료는 결제수단, 환불시점, 신청상태, 환불사유에 따라 다르게 적용 및 공제한다.
② 회원이 취소·환불 수수료 공제에 대한 세금계산서 또는 현금영수증을 희망하는 경우 고객센터로 문의한다.
③ 회원의 사정으로 인해 취소·환불을 요청할 경우, 결제수단에 따른 취소·환불 수수료는 아래와 같다.`;

const cancelTitle5 = `제5조 (취소 • 환불 수수료)`;

export const textarr: any = [
  {text: text1, title: titleText1},
  {text: text2, title: titleText2},
  {text: text3, title: titleText3},
  {text: text4, title: titleText4},
  {text: text5, title: titleText5},
  {text: text6, title: titleText6},
  {text: text7, title: titleText7},
  {text: text8, title: titleText8},
  {text: text9, title: titleText9},
  {text: text10, title: titleText10},
  {text: text11, title: titleText11},
  {text: text12, title: titleText12},
  {text: text13, title: titleText13},
  {text: text14, title: titleText14},
  {text: text15, title: titleText15},
  {text: text16, title: titleText16},
];

export const cancelTextarr: any = [
  {text: cancelText1, title: cancelTitle1},
  {text: cancelText2, title: cancelTitle2},
  {text: cancelText3, title: cancelTitle3},
  {text: cancelText4, title: cancelTitle4},
  {text: cancelText5, title: cancelTitle5},
];

const prititle1 = `1. 개인정보 수집목적 및 이용목적`;
const bordtext1 = '가. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산.';
const pritext1 = '콘텐츠 제공 , 구매 및 요금 결제 , 물품배송 또는 청구지 등 발송 , 금융거래 본인 인증 및 금융 서비스';

const bordtext2 = '나. 회원 관리 ';
const pritext2 = `회원제 서비스 이용에 따른 본인확인 , 개인 식별 , 불량회원의 부정 이용 방지와 비인가 사용 방지 , 가입 의사 확인 , 연령확인 , 만14세 미만 아동 개인정보 수집 시 법정 대리인 동의여부 확인, 불만처리 등 민원처리 , 고지사항 전달`;

const prititle3 = `\n 2. 수집하는 개인정보 항목 `;
const pritext3 = `: 이름, 로그인 ID, 로그인 비밀번호, 휴대전화번호, 14세미만 가입자의 경우 법정대리인의 정보`;

const prititle4 = `\n 3. 개인정보의 보유기간 및 이용기간`;
const pritext4 = `원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.`;

const bordtext3 = `가. 회사 내부 방침에 의한 정보 보유 사유`;
const pritext5 = `  •  부정거래 방지 및 운영방침에 따른 보관 : 5년`;

const bordtext4 = `나. 관련 법령에 의한 정보보유 사유`;
const pritext6 = `  •  계약 또는 청약철회 등에 관한 기록
         •  보존이유 : 전자상거래등에서의 소비자보호에 관한 \n            법률
         •  보존기간 : 5년
  •  대금 결제 및 재화 등의 공급에 관한 기록
         •  보존이유: 전자상거래등에서의 소비자보호에 관한 \n            법률
         •  보존기간 : 5년
  •  소비자 불만 또는 분쟁처리에 관한 기록
         •  보존이유 : 전자상거래등에서의 소비자보호에 관한 \n            법률
         •  보존기간 : 3년
  •  로그 기록
         •  보존이유: 통신비밀보호법
         •  보존기간 : 3개월`;

// const prititle2 = `수집하는 개인정보 항목`;
// const pritext2 = `: 이름, 로그인 ID, 로그인 비밀번호, 휴대전화번호, 14세미만 가입자의 경우 법정대리인의 정보`;

// const prititle3 = `개인정보의 보유기간 및 이용기간`;
// const pritext3 = `원칙적으로, 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.`;

export const priTextarr: any = [
  {text: pritext1, title: prititle1, border: bordtext1},
  {text: pritext2, title: '', border: bordtext2},
  {text: pritext3, title: prititle3, border: ''},
  {text: pritext4, title: prititle4, border: ''},
  {text: pritext5, title: '', border: bordtext3},
  {text: pritext6, title: '', border: bordtext4},
];

export const marketingtext = `“더킹스컴퍼니”(이하 "회사")는 개인정보보호법 등에 관한 법률 등 관계 법령에 따라 광고성 정보를 전송하기 위해 수신자의 사전 수신 동의를 받고 있으며, 수신자의 마케팅 정보 수신 동의 여부를 정기적으로 확인합니다. 마케팅 정보 수신 여부 및 마케팅을 위한 개인정보 수집이용을 거부할 수 있으며, 거부 시에도 “회사”의 서비스를 이용할 수 있으나, 각종 소식 및 행사 참여에 제한이 있을 수 있습니다. 
(단, 광고성 정보 이외 의무적으로 안내되어야 하는 정보성 내용은 수신 동의 여부와 무관하게 제공됩니다.)`;
